<<<<<<< HEAD
{"comments": ["This place has the most amazing black bean soup- impossible to adequately describe/ even has olives/ which is so unique/ flavor is intense.Will be coming back! I hear the lentil soup is great also/The green drink is great too/They have all types of smoothies which I will try next time!Highly recommended for something good, healthy and different!", "I popped in for a late lunch today and was not disappointed.  The place was clean and welcoming, and the staff very friendly. While I was eating another diner came in and was asking for details about the menu and ingredients, and the people working seemed knowledgeable and more than willing to help.I got the sloppy joe meal with jicama fries as a side.  The 'meat' on the sandwich was very flavorful, as was the onion bread.  The jicama fries were probably the best part - fresh tasting and spicy. The meal came with a huge pile of greens which I couldn't finish but which were also quite good.  I'm not vegan myself but I did not miss animal products at all.I also ordered a lemon kiss smoothie, which was good but not exceptional.  Still, with a lack of truly great smoothie options in Hyde Park I would definitely order one here again.It's clear that the people at B'Gabs put a lot of effort into using fresh ingredients and creating great flavors, and today I really felt they succeeded.  I will almost certainly be back when I get the chance.", "In the middle of detox, I needed some clean and raw food. I heard so much about this place but never had the opportunity. Usually, I dined at Soul Vegan East but I didn't needed feel like waiting for a long time. I'm glad that I visited the place. My meal, I had the burrito with peppermint tea. Wow!! It tasted so delicious!!  I've found the spot.  Great place, great environment , great service and wonderful people. They are very personable. The staff open and easy to talk to. I'm a novice to the vegan lifestyle. So therefore, I'm constantly looking for knowledge. I was pleased and impressed with the owner taking the time to enlighten me. B'Gabs has everything from herbal tea, in-scents, plant based proteins, raw deserts, specialties, smoothies, juices and many more.  I recommend this place for anyone whose detoxing, novice and wants more options on the south side.  The Great Plus is they are located in South side Hyde Park. I don't have to take a trip to the North Side to eat clean.", "I don't think I could maintain the discipline to be and stay vegan that is why I never tried.  I love spinach and every thing I had was great and fresh, a very unique eating experience. I had a burrito and kimchi both were great.  The kimchi was a different style I never had before.", "Love this place.  Vegetarian BUT tasty and desserts are killer.", "CRAZY FRIENDLY SERVICE, but it's too intense for me. Based on food alone, 3 stars, but with the awesome service, 4 stars. I like the atmosphere as well - part shop, part restaurant, all homey.I got one of the sandwiches. I don't really know what I was expecting, but it was more like the ingredients to a salad, minus the lettuce, layered between two very crumbly crackers made from seeds. The whole thing fell apart and was pretty much just vegetables. (Yeah yeah, Vegan restaurant, I know).Definitely a place for people who take their Veganism seriously - probably not so much for people just looking for a quick bite who aren't super into or aware of what being Vegan entails.I think if I ever go back to B'Gabs, I would get a smoothie or a salad instead.", "It's finally come. A HEALTHY fresh food and smoothie place in Hyde Park that is not Bonne Crappay! (Read my other two reviews on Bonne and you will understand my rage) The service was great and they had a massive selection of juices and smoothies. Location is super convenient and there is always parking around. I got a great salad along with my smoothie, I'm a happy gal! Smoothies run $6-$10 and salads I think around $12. The smoothies are hearty and a meal in their own right. Well worth it!", "A prime example of how raw vegan food can still taste excellent! The chipotle burger was amazing, as well as the broccoli side. Get the meal option (Salad w/ choice of 1 side), and you are sure to be full. If that isn't enough, add one of their delectable smoothies and you'll be stuffed. They aren't too small or too pricey like most smoothie places, and there's an impressive list of add-ons as well. I usually add cayenne, which is pretty spicy but not overbearing. Relatively affordable compared to other vegan/vegetarian places around the city. They also carry a wide variety of healthy food and drink options to carry home, like assorted teas and goji berries. Saves you the more expensive trip to whole foods.", "Seriously vegan !! this place is such a great find !! they have the best tasting vegan dishes ! I got the burrito and I didn't think that a vegan burrito could taste so good !!! it was spicy  and had great flavor . They have a huge selection of cold pressed juices and lots of spices and herbs they sell . They sell packets of spiraulina ( can't spell it right ) much cheaper than whole foods . It's a great place if you have a want a healthy lunch and a  smoothie  !", "Delicious food and friendly service. Had the sloppy joe and it was flavorful and the carrots gave it that special sweet flavor. Their 'bread' is equally amazing! Definitely going back for more next time I'm in the area.", "As I'm focusing more on health I found this place while looking for a smoothie in Hyde Park.  This is a \"For Real\" health food place, I was kinda out of my element but the staff was friendly and helpful.  I've been there twice and both times I ordered smoothies, I haven't tried the food yet.  I've had the Banana Pudding and Mighty Green smoothies, they both were great (as far as smoothies go).  The smoothies cost $5.75 and I was full for a few hours.  I don't think they sell meat products here, while glancing at the menu I noticed the burger was made with seed patty.  Overall a good experience.", "Peaceful atmosphere. A place of health, healing, peace, fun and great food! Get here.", "LOVE. The food, juices, and smoothies are fantastic: clean, delicious, and high quality.  I especially recommend the Chili Tacos, Chipotle Burger, and Bye-Bye Inflammation smoothie.And, as a note, eating raw feels amazing. You're never overly full or heavy, just perfectly satisfied and full of energy.  I've been eating raw more often at home and, while I still feel the benefits there, B'Gabs is a lot more delicious than anything I've ever made at home :) Highly, highly recommended.", "Bringing this review over from the original store.I am so in lust with B'Gabs Goodies.This place was my first venture into raw food and I was not disappointed.My first meal here was the chipotle burger with a side of jicama fries and salad greens. The burger was so flavorful (the onion bread is absolutely my favorite), the fries (jicama) and the salad greens (kale) were so fresh that I had to return the following day for another meal. And the chipotle cheese sauce is out of this world delicious.I have also tried the nachos and the tacos and both are tasty and creative as well.I appreciate that they deliver and I try to catch any Groupons they do.", "This place is the real deal. The owner Ron is a 20 year veteran vegan chef, he takes not only the ingredients but flavor very seriously. Give this a try, you will not be disappointed.", "I've been here before they moved to this location and became crazy about the raw tacos, but never there juices or smoothies! Fast forward over the summer I was in the neighborhood and seen they had moved to HP. I went in to get there raw tacos, the nice lady told me to get the meal so I could get the kale salad. I did along with a mango smoothie. It was a bit expensive for a simple smoothie. It tastes just like the mango one from McDonalds. I was not pleased especially for the price, my salad had no flavor the kale was dry. Oh the raw tacos I ( use to) love were horrible. The nut meat was not grinned well it actually made my teeth hurt because they were so hard! I hate to rate this place so low because it's a family establishment, but hey my $25 was so not worth it.", "Been meaning to try this place for a while since I'm vegetarian and I live right around the corner. Very welcoming vibe and awesome decor and collection of herbs, books, and alternative medicines. I had a green smoothie with kale, spinach, avocado, broccoli, and some other great stuff with a cayenne shot and a moringa root shot. Amazing. Creamy and tasty, yet clearly very real and healthy. Felt really clean afterwards haha!The staff were super friendly! Ray showed me around the place and talked to me about food, drinks, and other health products that the store offers. Really wide variety here, and it's a great place to learn more about healthy living. Apparently they have local music and poetry shows there some nights, which I thought was really really cool; and they're expanding the menu soon. Gotta come back to try some of the food next time, but thanks to an awesome first experience there I know there will be many next times :)", "Raw, vegan, and delicious! All of the food is great and the service is excellent.  I'm so happy to find a place like this in Hyde Park. Definitely recommend to vegans and non vegans.", "I had the chipotle burger/ with onion bread was great and tasty. It came with kimchi and it was spicy and I loved it. I love the fact that they sell loose herbal teas and its very reasonably. If you are into raw and vegan food, I highly recommend this restaurant.", "I just happened to look up vegan spots in the area and was pleasantly surprised when this presented itself. They immediately could tell I had not been there before and was extremely helpful when it came down to picking the right choice off the menu. I was skeptical when I noticed the ingredients but had faith that it would still turn out great!!! Well they exceeded my expectations and definitely will be going back!"], "lat": 41.7915136, "long": -87.5897742, "score": 4.72093023255814}
=======
{"comments": ["Valois is not just another cafeteria; it is an institution. If you're a Hyde Parker, you know Valois. I have been eating here since I was a kid, and, aside from the expansion in recent years, the food and the people have never changed. They are courteous, efficient, and proud of their service. Since opening in 1921, Valois has been providing tasty, home-style food to Chicago's South Side. Since 1973, when Spiros Argiris and Gus Sellis took over ownership, Valois continues to thrive and provide a great value for the price.  My personal favorites are the feta omelette with hash browns, turkey sausage, and coffee, as well as the baked chicken, mashed potatoes, corn, and coffee. I can't think of anywhere else in the city where you can get this amount of quality food for this cheap of a price. People talk about Manny's or Katz's in NYC, but Valois (in my admittedly biased opinion) bests them all.", "Cash only so they don't pay a debit card or credit card processing feeonly gets a two  star because the feta omelette and burger was good.pancakes suckedthe amazing corned hash hot sandwich sssuuuhhuucckkeedddthe people look miserable there and they were rude and very short with us.silverware wasn't the cleanest and the place just looks like whatever.the only modern thing is the menu.... aannnndddd yeah that's it.one of obamas favorites huhI dunno I'm from SF and our food is amazing maybe I'm biased and maybe this place is ok.not wowed", "Valois is a cafeteria-style diner in an up and coming part of Hyde Park. There is a Chipotle next door, and an Akira clothing store kitty corner to the diner. Upon entering, you'll see a red, white, and blue sign that lists President Obama's favorite orders. Food: On this visit, I ordered the NY steak well-done, hashbrowns, scrambled eggs with cheese (add 25 cents), side order of biscuits,  and a coffee with cream. The dinner roll-like biscuits come with packets of jam and butter. I enjoyed the biscuits the most. The steak was well-done, as I had asked. Its a good-sized steak for the price you pay. The cashier will add cream to your coffee for you like Dunkin Donuts. The hashbrowns were stringy, soft with crunchier strips of potatoes. The eggs were also soft, with just a little cheese scrambled in. Not gooey with cheese as one would expect. I felt like the food was a little lacking in flavor, but its cafeteria-style, so that's expected.   Seating area: self-assigned seating just like the school cafeteria. Staff will bring you steak sauce and water. Overall, I had a positive experience here. I understand why this was President Obama's go-to place. None of the long lines or pretentious servers on Sunday mornings- just good, honest food at affordable prices.", "The vibe I got when dining here was diner mixed in with a local breakfast joint. The food was delicious for the price. And it was hilarious to see the different food items ordered by Obama himself. I ordered the vegetable omelette and there was so much food that came with it! It was an absolute gem to find this in Hyde park after a long hard day at work. Honestly, this is probably one of the best places to eat in Hyde Park!! Just a note, it is cash only so make sure you have cash in hand to pay for your meal.", "Obama and I might not agree on everything politically, but we do have consensus on Valois' No. 1: N.Y. Steak and Eggs ($9.95 as of 06/29/2015).  I didn't expect much from a family-owned Greek diner place like this.  However, it wouldn't hurt to fuel up our bodies with steak, scrambled eggs, hash browns, and wheat toast.  Here's the flow of how the ordering process works in Valois: 1) grab a tray2) tell the handsome Greek man what you want3) move your tray down to the next person you encounter4) figure out if you want toast (white or wheat), coffee, pop, or any other add-ons5) pay with the cashier (cash-only; ATM is available inside) I HIGHLY recommended the No. 1 on the Obama's favorite list.  That steak was juicy, meaty, and cooked exactly how you wanted.  Some have mentioned in the previous reviews on the quality of this middle-class diner steak.  Anyways, they were correct!  This piece of steak could easily put Gibs*n's or Ru*h Chr*s to shame!  Daddy J., on the other hand, liked the hash browns.  He said he isn't normally a fan of potatoes.  Nevertheless, he was very satisfied and delighted upon finishing his meal.  Valois also offers free wifi, so young folks shouldn't be intimidated by coming to this historical family-friendly diner.  What a Chicago institution!  While there's no CTA train stations in the Hyde Park area.  The Metra (53rd. St.) is very close by and there are various CTA buses (#15 and #28) that will take you 53rd./Harper.  Otherwise, try CTA bus #55 (55th.-Garfield) and walk southbound.", "Check this brunch place out for more than your average cafeteria fare.  Save room for the entrees (e.g., corned beef hash, chicken pot pie) and desserts (e.g., cream pie).  Just beware of lines ever since Obama came here.", "As good as Chicago gets. Simple as.", "Exactly what it should be.  Food is tasty, and presumably unchanged since the place opened.Get a biscuit!", "1st I was off today and I use to go to this place back in the day's. Well my my my this place has changed. My coffee was like very bitter.  And my food looked much better then it tasted. The biscuit's was not a winner at all more like hard corn bread.  If my granny was still living I would  get her a job in 40 mins.  And you would have melt in your mouth biscuits. And need I say more about the butter packs can you say FROZEN. 2ndI was ready to SHUT the front door when the butter had no flavor and could not melt on cold Biscuits. So this place got 2stars. 1 for my omelette was OK. And the other 1 because my Co Worker enjoyed her bacon.", "Not phenomenal, but I definitely can't complain about a place with large portions of decent food at super low prices.We came here since a friend of mine really wants to check out \"the Obama place.\"There was somewhat of a line when we came in, but it moved pretty quickly. I got the Obama menu #1 (NY Steak and eggs) and my friend got the #4 (steak omelette).It is really a terrific deal that I got a large piece of steak, 2 eggs, a load of hash browns, and two pieces of toast for just under $10. Despite the low price, the steak was actually pretty thick and tender - it might just be the best piece of diner steak I've ever had. Everything else was just very standard, nothing blew my mind but definitely not bad either.P.S. Do be aware that this is CASH ONLY.", "This is the kind of place you go for a breakfast/brunch/lunch after a really late night out. (It's also the place you go on that really late night out, not just because everything else in Hyde Park is closed, but because they offer just the right ratios of meat:cheese:bread to get you through the wee morning hours.) The price can't be beat and it's a great place for a group. The line can be long, but it moves pretty quickly. Getting your food is kind of like being in a standard cafeteria- trays, then napkins, then slide down to order. You should definitely know what you want when you get your tray though- there is no patience from anyone (customers or servers) if you don't!My personal favorite is coffee and the breakfast sandwich with eggs, sausage, and cheese, but I always find myself eyeing the pastry case at the end of the line. Their french toast is another strong choice.", "It is what it is.  Cafeteria dining at its finest.  It's just food, cooked.  Good when you are hungry.   We spent $16 and were absolutely stuffed.  A variety of entrées and sides from which to choose.  The biscuits are huge, fluffy with a hint of sweetness and they give you TWO.  Looks like a good place for breakfast too.  We will return for a breakfast one of these days.  We're curious to see if the $1.40 coffee is good.", "Come on feel Valois! Girls, rock your boys! A consistently excellent hangover-breakfast spot, cheap with large portions, and delivered with stern efficiency. Try the Bacon Egg and Cheese on Toast Sandwich and the French Toast. And if you're a Steak and Eggs kinda fellow, you'll be very happy.A word to the wise, though: I have not been there for lunch or dinner. In fact, I am not convinced that anyone has ever been to Valois to lunch or dinner.", "Such a special place. Great staff, efficient service, unbelievably low prices for quality food, great coffee too - Katz's pales in comparison at 4x the price. I had a great experience here and would definitely come back again and again if I lived here.", "Best brunch in Hyde Park, hands down. Valois is an institution in Hyde Park, and for good reason. It offers delicious, generous breakfast, lunch, and dinner offerings quickly and cheaply. Grits, omelettes, steak and eggs, biscuits, pancakes - you name it, they'll have it. It's cash-only and dining hall/cafeteria style, so make sure to enter that line prepared! My go-to's are the 3-egg omelettes - either the Mediterranean (spinach, feta, tomato) or the steak omelette. The omelettes are fluffy and gooey, the hashbrowns crunchy, and bacon crispy. You will leave full and beyond satisfied for less than $10, easy. Need I say more?", "After 2 years in Hyde Park this is my go-to, has-never-let-me-down, favorite place to eat. I love it's no nonsense style and I can't help but get breakfast every single time I go, no matter what time it is.  It's so cheap and they give you a lot to eat.It can get packed in there and even if there is an insane line, you should wait. The service is so fast and reliable that a seemingly terrible wait gets handled very quickly.Cash Only. ATM inside. Good coffee and great omelettes! Bike parking to the side in Harper Court.", "This place is AMAZING!! Lines go super quick. I had the Steak Omelette; so delicious! The coffee here is great as well! Will definitely come here again!", "The Chicago version of Waffle House. Cheap, fast, great neighborhood vibes, and damn good breakfast food. Cash only!", "For the price, this place is great. Definitely a Chicago institution, and in particular a favorite for South Siders, U of C students, faculty, and staff. Nothing amazing but just good standard diner fare in a cafeteria setting. I really like the Midwest cafeteria concept (I've only ever seen it here in Chicago and in Indianapolis at places like Manny's and Shapiro's).Cash only!", "It's everything everyone says it is. It's an institution of the area; it's someplace you have to go eventually. This is just basic, diner fare done right, in great quantities with some nice options. Denver omelette, three pancakes, hashbrowns and some biscuits will last me almost the entire day. Don't go in expecting anything more, but if this is what you're looking for, it'll always hit the spot. Only complaint is the cash-only situation, but on the other hand this has probably saved me a number of times too."], "long": -87.588365, "lat": 41.7997923, "score": 4.097315436241611}
>>>>>>> 831a35893ce98a65597e35448a0a78ce3f264284
