{"comments": ["This place has the most amazing black bean soup- impossible to adequately describe/ even has olives/ which is so unique/ flavor is intense.Will be coming back! I hear the lentil soup is great also/The green drink is great too/They have all types of smoothies which I will try next time!Highly recommended for something good, healthy and different!", "I popped in for a late lunch today and was not disappointed.  The place was clean and welcoming, and the staff very friendly. While I was eating another diner came in and was asking for details about the menu and ingredients, and the people working seemed knowledgeable and more than willing to help.I got the sloppy joe meal with jicama fries as a side.  The 'meat' on the sandwich was very flavorful, as was the onion bread.  The jicama fries were probably the best part - fresh tasting and spicy. The meal came with a huge pile of greens which I couldn't finish but which were also quite good.  I'm not vegan myself but I did not miss animal products at all.I also ordered a lemon kiss smoothie, which was good but not exceptional.  Still, with a lack of truly great smoothie options in Hyde Park I would definitely order one here again.It's clear that the people at B'Gabs put a lot of effort into using fresh ingredients and creating great flavors, and today I really felt they succeeded.  I will almost certainly be back when I get the chance.", "In the middle of detox, I needed some clean and raw food. I heard so much about this place but never had the opportunity. Usually, I dined at Soul Vegan East but I didn't needed feel like waiting for a long time. I'm glad that I visited the place. My meal, I had the burrito with peppermint tea. Wow!! It tasted so delicious!!  I've found the spot.  Great place, great environment , great service and wonderful people. They are very personable. The staff open and easy to talk to. I'm a novice to the vegan lifestyle. So therefore, I'm constantly looking for knowledge. I was pleased and impressed with the owner taking the time to enlighten me. B'Gabs has everything from herbal tea, in-scents, plant based proteins, raw deserts, specialties, smoothies, juices and many more.  I recommend this place for anyone whose detoxing, novice and wants more options on the south side.  The Great Plus is they are located in South side Hyde Park. I don't have to take a trip to the North Side to eat clean.", "I don't think I could maintain the discipline to be and stay vegan that is why I never tried.  I love spinach and every thing I had was great and fresh, a very unique eating experience. I had a burrito and kimchi both were great.  The kimchi was a different style I never had before.", "Love this place.  Vegetarian BUT tasty and desserts are killer.", "CRAZY FRIENDLY SERVICE, but it's too intense for me. Based on food alone, 3 stars, but with the awesome service, 4 stars. I like the atmosphere as well - part shop, part restaurant, all homey.I got one of the sandwiches. I don't really know what I was expecting, but it was more like the ingredients to a salad, minus the lettuce, layered between two very crumbly crackers made from seeds. The whole thing fell apart and was pretty much just vegetables. (Yeah yeah, Vegan restaurant, I know).Definitely a place for people who take their Veganism seriously - probably not so much for people just looking for a quick bite who aren't super into or aware of what being Vegan entails.I think if I ever go back to B'Gabs, I would get a smoothie or a salad instead.", "It's finally come. A HEALTHY fresh food and smoothie place in Hyde Park that is not Bonne Crappay! (Read my other two reviews on Bonne and you will understand my rage) The service was great and they had a massive selection of juices and smoothies. Location is super convenient and there is always parking around. I got a great salad along with my smoothie, I'm a happy gal! Smoothies run $6-$10 and salads I think around $12. The smoothies are hearty and a meal in their own right. Well worth it!", "A prime example of how raw vegan food can still taste excellent! The chipotle burger was amazing, as well as the broccoli side. Get the meal option (Salad w/ choice of 1 side), and you are sure to be full. If that isn't enough, add one of their delectable smoothies and you'll be stuffed. They aren't too small or too pricey like most smoothie places, and there's an impressive list of add-ons as well. I usually add cayenne, which is pretty spicy but not overbearing. Relatively affordable compared to other vegan/vegetarian places around the city. They also carry a wide variety of healthy food and drink options to carry home, like assorted teas and goji berries. Saves you the more expensive trip to whole foods.", "Seriously vegan !! this place is such a great find !! they have the best tasting vegan dishes ! I got the burrito and I didn't think that a vegan burrito could taste so good !!! it was spicy  and had great flavor . They have a huge selection of cold pressed juices and lots of spices and herbs they sell . They sell packets of spiraulina ( can't spell it right ) much cheaper than whole foods . It's a great place if you have a want a healthy lunch and a  smoothie  !", "Delicious food and friendly service. Had the sloppy joe and it was flavorful and the carrots gave it that special sweet flavor. Their 'bread' is equally amazing! Definitely going back for more next time I'm in the area.", "As I'm focusing more on health I found this place while looking for a smoothie in Hyde Park.  This is a \"For Real\" health food place, I was kinda out of my element but the staff was friendly and helpful.  I've been there twice and both times I ordered smoothies, I haven't tried the food yet.  I've had the Banana Pudding and Mighty Green smoothies, they both were great (as far as smoothies go).  The smoothies cost $5.75 and I was full for a few hours.  I don't think they sell meat products here, while glancing at the menu I noticed the burger was made with seed patty.  Overall a good experience.", "Peaceful atmosphere. A place of health, healing, peace, fun and great food! Get here.", "LOVE. The food, juices, and smoothies are fantastic: clean, delicious, and high quality.  I especially recommend the Chili Tacos, Chipotle Burger, and Bye-Bye Inflammation smoothie.And, as a note, eating raw feels amazing. You're never overly full or heavy, just perfectly satisfied and full of energy.  I've been eating raw more often at home and, while I still feel the benefits there, B'Gabs is a lot more delicious than anything I've ever made at home :) Highly, highly recommended.", "Bringing this review over from the original store.I am so in lust with B'Gabs Goodies.This place was my first venture into raw food and I was not disappointed.My first meal here was the chipotle burger with a side of jicama fries and salad greens. The burger was so flavorful (the onion bread is absolutely my favorite), the fries (jicama) and the salad greens (kale) were so fresh that I had to return the following day for another meal. And the chipotle cheese sauce is out of this world delicious.I have also tried the nachos and the tacos and both are tasty and creative as well.I appreciate that they deliver and I try to catch any Groupons they do.", "This place is the real deal. The owner Ron is a 20 year veteran vegan chef, he takes not only the ingredients but flavor very seriously. Give this a try, you will not be disappointed.", "I've been here before they moved to this location and became crazy about the raw tacos, but never there juices or smoothies! Fast forward over the summer I was in the neighborhood and seen they had moved to HP. I went in to get there raw tacos, the nice lady told me to get the meal so I could get the kale salad. I did along with a mango smoothie. It was a bit expensive for a simple smoothie. It tastes just like the mango one from McDonalds. I was not pleased especially for the price, my salad had no flavor the kale was dry. Oh the raw tacos I ( use to) love were horrible. The nut meat was not grinned well it actually made my teeth hurt because they were so hard! I hate to rate this place so low because it's a family establishment, but hey my $25 was so not worth it.", "Been meaning to try this place for a while since I'm vegetarian and I live right around the corner. Very welcoming vibe and awesome decor and collection of herbs, books, and alternative medicines. I had a green smoothie with kale, spinach, avocado, broccoli, and some other great stuff with a cayenne shot and a moringa root shot. Amazing. Creamy and tasty, yet clearly very real and healthy. Felt really clean afterwards haha!The staff were super friendly! Ray showed me around the place and talked to me about food, drinks, and other health products that the store offers. Really wide variety here, and it's a great place to learn more about healthy living. Apparently they have local music and poetry shows there some nights, which I thought was really really cool; and they're expanding the menu soon. Gotta come back to try some of the food next time, but thanks to an awesome first experience there I know there will be many next times :)", "Raw, vegan, and delicious! All of the food is great and the service is excellent.  I'm so happy to find a place like this in Hyde Park. Definitely recommend to vegans and non vegans.", "I had the chipotle burger/ with onion bread was great and tasty. It came with kimchi and it was spicy and I loved it. I love the fact that they sell loose herbal teas and its very reasonably. If you are into raw and vegan food, I highly recommend this restaurant.", "I just happened to look up vegan spots in the area and was pleasantly surprised when this presented itself. They immediately could tell I had not been there before and was extremely helpful when it came down to picking the right choice off the menu. I was skeptical when I noticed the ingredients but had faith that it would still turn out great!!! Well they exceeded my expectations and definitely will be going back!"], "lat": 41.7915136, "long": -87.5897742, "score": 4.72093023255814}