{"comments": ["Valois is not just another cafeteria; it is an institution. If you're a Hyde Parker, you know Valois. I have been eating here since I was a kid, and, aside from the expansion in recent years, the food and the people have never changed. They are courteous, efficient, and proud of their service. Since opening in 1921, Valois has been providing tasty, home-style food to Chicago's South Side. Since 1973, when Spiros Argiris and Gus Sellis took over ownership, Valois continues to thrive and provide a great value for the price.  My personal favorites are the feta omelette with hash browns, turkey sausage, and coffee, as well as the baked chicken, mashed potatoes, corn, and coffee. I can't think of anywhere else in the city where you can get this amount of quality food for this cheap of a price. People talk about Manny's or Katz's in NYC, but Valois (in my admittedly biased opinion) bests them all.", "Cash only so they don't pay a debit card or credit card processing feeonly gets a two  star because the feta omelette and burger was good.pancakes suckedthe amazing corned hash hot sandwich sssuuuhhuucckkeedddthe people look miserable there and they were rude and very short with us.silverware wasn't the cleanest and the place just looks like whatever.the only modern thing is the menu.... aannnndddd yeah that's it.one of obamas favorites huhI dunno I'm from SF and our food is amazing maybe I'm biased and maybe this place is ok.not wowed", "Valois is a cafeteria-style diner in an up and coming part of Hyde Park. There is a Chipotle next door, and an Akira clothing store kitty corner to the diner. Upon entering, you'll see a red, white, and blue sign that lists President Obama's favorite orders. Food: On this visit, I ordered the NY steak well-done, hashbrowns, scrambled eggs with cheese (add 25 cents), side order of biscuits,  and a coffee with cream. The dinner roll-like biscuits come with packets of jam and butter. I enjoyed the biscuits the most. The steak was well-done, as I had asked. Its a good-sized steak for the price you pay. The cashier will add cream to your coffee for you like Dunkin Donuts. The hashbrowns were stringy, soft with crunchier strips of potatoes. The eggs were also soft, with just a little cheese scrambled in. Not gooey with cheese as one would expect. I felt like the food was a little lacking in flavor, but its cafeteria-style, so that's expected.   Seating area: self-assigned seating just like the school cafeteria. Staff will bring you steak sauce and water. Overall, I had a positive experience here. I understand why this was President Obama's go-to place. None of the long lines or pretentious servers on Sunday mornings- just good, honest food at affordable prices.", "The vibe I got when dining here was diner mixed in with a local breakfast joint. The food was delicious for the price. And it was hilarious to see the different food items ordered by Obama himself. I ordered the vegetable omelette and there was so much food that came with it! It was an absolute gem to find this in Hyde park after a long hard day at work. Honestly, this is probably one of the best places to eat in Hyde Park!! Just a note, it is cash only so make sure you have cash in hand to pay for your meal.", "Obama and I might not agree on everything politically, but we do have consensus on Valois' No. 1: N.Y. Steak and Eggs ($9.95 as of 06/29/2015).  I didn't expect much from a family-owned Greek diner place like this.  However, it wouldn't hurt to fuel up our bodies with steak, scrambled eggs, hash browns, and wheat toast.  Here's the flow of how the ordering process works in Valois: 1) grab a tray2) tell the handsome Greek man what you want3) move your tray down to the next person you encounter4) figure out if you want toast (white or wheat), coffee, pop, or any other add-ons5) pay with the cashier (cash-only; ATM is available inside) I HIGHLY recommended the No. 1 on the Obama's favorite list.  That steak was juicy, meaty, and cooked exactly how you wanted.  Some have mentioned in the previous reviews on the quality of this middle-class diner steak.  Anyways, they were correct!  This piece of steak could easily put Gibs*n's or Ru*h Chr*s to shame!  Daddy J., on the other hand, liked the hash browns.  He said he isn't normally a fan of potatoes.  Nevertheless, he was very satisfied and delighted upon finishing his meal.  Valois also offers free wifi, so young folks shouldn't be intimidated by coming to this historical family-friendly diner.  What a Chicago institution!  While there's no CTA train stations in the Hyde Park area.  The Metra (53rd. St.) is very close by and there are various CTA buses (#15 and #28) that will take you 53rd./Harper.  Otherwise, try CTA bus #55 (55th.-Garfield) and walk southbound.", "Check this brunch place out for more than your average cafeteria fare.  Save room for the entrees (e.g., corned beef hash, chicken pot pie) and desserts (e.g., cream pie).  Just beware of lines ever since Obama came here.", "As good as Chicago gets. Simple as.", "Exactly what it should be.  Food is tasty, and presumably unchanged since the place opened.Get a biscuit!", "1st I was off today and I use to go to this place back in the day's. Well my my my this place has changed. My coffee was like very bitter.  And my food looked much better then it tasted. The biscuit's was not a winner at all more like hard corn bread.  If my granny was still living I would  get her a job in 40 mins.  And you would have melt in your mouth biscuits. And need I say more about the butter packs can you say FROZEN. 2ndI was ready to SHUT the front door when the butter had no flavor and could not melt on cold Biscuits. So this place got 2stars. 1 for my omelette was OK. And the other 1 because my Co Worker enjoyed her bacon.", "Not phenomenal, but I definitely can't complain about a place with large portions of decent food at super low prices.We came here since a friend of mine really wants to check out \"the Obama place.\"There was somewhat of a line when we came in, but it moved pretty quickly. I got the Obama menu #1 (NY Steak and eggs) and my friend got the #4 (steak omelette).It is really a terrific deal that I got a large piece of steak, 2 eggs, a load of hash browns, and two pieces of toast for just under $10. Despite the low price, the steak was actually pretty thick and tender - it might just be the best piece of diner steak I've ever had. Everything else was just very standard, nothing blew my mind but definitely not bad either.P.S. Do be aware that this is CASH ONLY.", "This is the kind of place you go for a breakfast/brunch/lunch after a really late night out. (It's also the place you go on that really late night out, not just because everything else in Hyde Park is closed, but because they offer just the right ratios of meat:cheese:bread to get you through the wee morning hours.) The price can't be beat and it's a great place for a group. The line can be long, but it moves pretty quickly. Getting your food is kind of like being in a standard cafeteria- trays, then napkins, then slide down to order. You should definitely know what you want when you get your tray though- there is no patience from anyone (customers or servers) if you don't!My personal favorite is coffee and the breakfast sandwich with eggs, sausage, and cheese, but I always find myself eyeing the pastry case at the end of the line. Their french toast is another strong choice.", "It is what it is.  Cafeteria dining at its finest.  It's just food, cooked.  Good when you are hungry.   We spent $16 and were absolutely stuffed.  A variety of entrées and sides from which to choose.  The biscuits are huge, fluffy with a hint of sweetness and they give you TWO.  Looks like a good place for breakfast too.  We will return for a breakfast one of these days.  We're curious to see if the $1.40 coffee is good.", "Come on feel Valois! Girls, rock your boys! A consistently excellent hangover-breakfast spot, cheap with large portions, and delivered with stern efficiency. Try the Bacon Egg and Cheese on Toast Sandwich and the French Toast. And if you're a Steak and Eggs kinda fellow, you'll be very happy.A word to the wise, though: I have not been there for lunch or dinner. In fact, I am not convinced that anyone has ever been to Valois to lunch or dinner.", "Such a special place. Great staff, efficient service, unbelievably low prices for quality food, great coffee too - Katz's pales in comparison at 4x the price. I had a great experience here and would definitely come back again and again if I lived here.", "Best brunch in Hyde Park, hands down. Valois is an institution in Hyde Park, and for good reason. It offers delicious, generous breakfast, lunch, and dinner offerings quickly and cheaply. Grits, omelettes, steak and eggs, biscuits, pancakes - you name it, they'll have it. It's cash-only and dining hall/cafeteria style, so make sure to enter that line prepared! My go-to's are the 3-egg omelettes - either the Mediterranean (spinach, feta, tomato) or the steak omelette. The omelettes are fluffy and gooey, the hashbrowns crunchy, and bacon crispy. You will leave full and beyond satisfied for less than $10, easy. Need I say more?", "After 2 years in Hyde Park this is my go-to, has-never-let-me-down, favorite place to eat. I love it's no nonsense style and I can't help but get breakfast every single time I go, no matter what time it is.  It's so cheap and they give you a lot to eat.It can get packed in there and even if there is an insane line, you should wait. The service is so fast and reliable that a seemingly terrible wait gets handled very quickly.Cash Only. ATM inside. Good coffee and great omelettes! Bike parking to the side in Harper Court.", "This place is AMAZING!! Lines go super quick. I had the Steak Omelette; so delicious! The coffee here is great as well! Will definitely come here again!", "The Chicago version of Waffle House. Cheap, fast, great neighborhood vibes, and damn good breakfast food. Cash only!", "For the price, this place is great. Definitely a Chicago institution, and in particular a favorite for South Siders, U of C students, faculty, and staff. Nothing amazing but just good standard diner fare in a cafeteria setting. I really like the Midwest cafeteria concept (I've only ever seen it here in Chicago and in Indianapolis at places like Manny's and Shapiro's).Cash only!", "It's everything everyone says it is. It's an institution of the area; it's someplace you have to go eventually. This is just basic, diner fare done right, in great quantities with some nice options. Denver omelette, three pancakes, hashbrowns and some biscuits will last me almost the entire day. Don't go in expecting anything more, but if this is what you're looking for, it'll always hit the spot. Only complaint is the cash-only situation, but on the other hand this has probably saved me a number of times too."], "long": -87.588365, "lat": 41.7997923, "score": 4.097315436241611}